/******************************************************************************/
/*                                                                            */
/* unit_test/util.c                                                           */
/*                                                                 2024/04/30 */
/* Copyright (C) 2024 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* cunit */
#include <CUnit/CUnit.h>

/* 共通ヘッダ */
#include <test.h>


/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
/** CallCount最大 */
#define CALL_COUNT_MAX ( 20 )


/******************************************************************************/
/* 静的グローバル変数定義                                                     */
/******************************************************************************/
/** 呼出し回数 */
static unsigned int gCallCount;

/** 呼出し関数履歴 */
static void *gpCallFunc[ CALL_COUNT_MAX ];


/******************************************************************************/
/* グローバル関数定義                                                         */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief       関数呼出し回数取得
 * @details     関数呼出し回数を返す。
 *
 * @return      関数呼出し回数
 */
/******************************************************************************/
unsigned int UtilGetCallCount( void )
{
    return gCallCount;
}


/******************************************************************************/
/**
 * @brief       呼出し関数アドレス取得
 * @details     呼出し関数アドレスを返す。
 *
 * @param[in]   count 呼出し番号(0オリジン)
 *
 * @return      呼出し関数アドレス
 */
/******************************************************************************/
void *UtilGetCallFunc( unsigned int no )
{
    /* 呼出し番号上限チェック */
    if ( no >= CALL_COUNT_MAX ) {
        /* 超過 */

        return NULL;
    }

    return gpCallFunc[ no ];
}


/******************************************************************************/
/**
 * @brief       ユーティリティ初期化
 * @details     全ユーティリティを初期化する。
 */
/******************************************************************************/
void UtilInit( void )
{
    UtilInitCallCount();

    return;
}


/******************************************************************************/
/**
 * @brief       CallCount初期化
 * @details     CallCount機能を初期化する。
 */
/******************************************************************************/
void UtilInitCallCount( void )
{
    unsigned int i;

    /* 呼出し回数初期化 */
    gCallCount = 0;

    /* 呼出し関数履歴初期化 */
    for ( i = 0; i < CALL_COUNT_MAX; i++ ) {
        gpCallFunc[ i ] = NULL;
    }

    return;
}


/******************************************************************************/
/**
 * @brieaf      CallCount登録
 * @details     呼出し関数アドレスを記録し、呼び出し回数をインクリメントする。
 *
 * @param[in]   *pFunc 呼出し関数アドレス
 *
 * @return      登録関数の呼出し回数を返す。
 */
/******************************************************************************/
unsigned int UtilSetCallCount( void *pFunc )
{
    unsigned int i;
    unsigned int cnt;

    /* 初期化 */
    i   = 0;
    cnt = 0;

    /* CallCount上限チェック */
    if ( gCallCount >= CALL_COUNT_MAX ) {
        /* 超過 */
        return 0;
    }

    /* CallCount登録 */
    gpCallFunc[ gCallCount++ ] = pFunc;

    /* 登録関数の呼出し回数カウント */
    for ( i = 0; i < gCallCount; i++ ) {
        if ( gpCallFunc[ i ] == pFunc ) {
            cnt++;
        }
    }

    return cnt;
}


/******************************************************************************/

