/******************************************************************************/
/*                                                                            */
/* src/stdio/snprintf.c                                                       */
/*                                                                 2024/01/04 */
/* Copyright (C) 2019-2024 Mochi.                                             */
/*                                                                            */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stdarg.h>
#include <stddef.h>
#include <stdio.h>


/******************************************************************************/
/* グローバル関数定義                                                         */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief       snprintf
 * @details     書式付き文字列と可変長引数から文字列を出力する。文字列は文字列
 *              終端文字\\0を含めた最大出力文字数分を出力する。
 *
 * @param[out]  *s      出力先文字列
 * @param[in]   n       最大出力文字数（\\0を含む）
 * @param[in]   *format 書式付き文字列
 * @param[in]   ...     可変長引数
 *
 * @return      出力文字数（\\0を含まない）を返す。
 */
/******************************************************************************/
int snprintf( char       *s,
              size_t     n,
              const char *format,
              ...                 )
{
    int     ret;    /* 戻り値           */
    va_list vaList; /* 可変長引数リスト */

    /* 初期化 */
    ret = 0;
    va_start( vaList, format );

    /* 書式変換 */
    ret = vsnprintf( s, n, format, vaList );

    va_end( vaList );

    return ret;
}


/******************************************************************************/
