/******************************************************************************/
/*                                                                            */
/* integ_test/stdio/snprintf.c                                                */
/*                                                                 2024/04/30 */
/* Copyright (C) 2024 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stdarg.h>

/* cunitヘッダ */
#include <CUnit/CUnit.h>
#include <CUnit/Basic.h>


/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
#define SUITE_PREFIX "stdio/snprintf@"
#define snprintf _snprintf

/******************************************************************************/
/* テスト対象ファイル                                                         */
/******************************************************************************/
#include "stdio/snprintf.c"


/******************************************************************************/
/* snprintf                                                                   */
/******************************************************************************/
#define TEST_SNPRINTF( _NO,                                     \
                       _IN_N,                                   \
                       _IN_FORMAT,                              \
                       _OUT_RET,                                \
                       _OUT_S,                                  \
                       ...         )                            \
    static void test_snprintf_##_NO( void )                     \
    {                                                           \
        unsigned int  i;                                        \
        int           ret;                                      \
        char          s[ _IN_N + 1 ];                           \
                                                                \
        /* INPUT初期化 */                                       \
        for ( i = 0; i < _IN_N + 1; i++ ) {                     \
            s[ i ] = 0;                                         \
        }                                                       \
                                                                \
        ret = snprintf( s, _IN_N, _IN_FORMAT, ##__VA_ARGS__ );  \
                                                                \
        /* OUTPUT判定 */                                        \
        CU_ASSERT_EQUAL(        ret, _OUT_RET );                \
        CU_ASSERT_STRING_EQUAL( s,   _OUT_S   );                \
                                                                \
        return;                                                 \
    }

/*           | # | INPUT           | OUTPUT             | INPUT */
/*           |   | n | format      | ret | s            | ...   */
TEST_SNPRINTF(  1, 11, "1234567890",   10, "1234567890"         );

static void test_snprintf( void )
{
    CU_pSuite suite = CU_add_suite( SUITE_PREFIX "snprintf", NULL, NULL );

    CU_add_test( suite, "#_1", test_snprintf_1  );

    return;
}

/******************************************************************************/
/* テスト対象登録                                                             */
/******************************************************************************/
void stdio_snprintf( void )
{
    test_snprintf();

    return;
}


/******************************************************************************/

